read -sv benchmarks/seq/s298.v
read -sv libraries/dff.v
hierarchy -top s298

# Interpret design
proc; opt
techmap; opt
flatten;

#show s510
sat -seq 2 -dump_cnf cnfs/s298.cnf s298

