read -sv benchmarks/seq/s27.v
read -sv libraries/dff.v
hierarchy -top s27

# Interpret design
proc; opt; techmap; opt
#flatten
show s27
sat -all -seq 2 -dump_cnf cnfs/s27.cnf s27 


