
# Read and build hierarchy
#read_liberty -ignore_miss_func libraries/mylib.lib
#design -save lib
read -sv benchmarks/seq/s27.v
read -sv dff.sv
hierarchy -top s27

# Interpret design
proc; opt; techmap; opt

# Finish library mapping
#dfflibmap -liberty libraries/mylib.lib

# Post processing
sat -show-ports -all -seq 2 s27
#write_verilog synth.v
#show s27

